Revit 2024 API
TopographySurface.IsBoundaryPoint Method
 Identifies whether the given point is an existing boundary point of the current topography surface.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsBoundaryPoint(
	XYZ point
)
Visual Basic
Public Function IsBoundaryPoint ( _
	point As XYZ _
) As Boolean
Visual C++
public:
bool IsBoundaryPoint(
	XYZ^ point
)
Parameters
point
Type: Autodesk.Revit.DB.XYZ
 The point to be checked.
Return Value
 Returns true if a given point is an existing boundary point. For TopographySurface and SiteSubRegion elements, it returns false if the given point is an existing interior point of current topography surface. For the topography surface associated with a BuildingPad element, it always returns true if the point is a part of the element (all points are boundary points for the topography surface associated with a BuildingPad element).
Remarks
 This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element. The given point will be evaluated in XYZ. If a point matches the XY location, but not the elevation, an ArgumentException will be thrown if this point does not exist in current topography surface.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input point does not exist in the current topography surface.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace